{
    "format": "layers-model",
    "generatedBy": "keras v3.3.3",
    "convertedBy": "TensorFlow.js Converter v4.19.0",
    "modelTopology": {
        "keras_version": "3.3.3",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_31",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_21"
                        },
                        "name": "input_layer_21",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block1_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block1_conv1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                224,
                                                224,
                                                3
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "input_layer_21",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block1_conv2",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block1_conv2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                224,
                                                224,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block1_conv1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "block1_pool",
                            "trainable": false,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "block1_pool",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                224,
                                                224,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block1_conv2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block2_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block2_conv1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                112,
                                                112,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block1_pool",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block2_conv2",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block2_conv2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                112,
                                                112,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block2_conv1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "block2_pool",
                            "trainable": false,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "block2_pool",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                112,
                                                112,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block2_conv2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block3_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block3_conv1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                56,
                                                56,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block2_pool",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block3_conv2",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block3_conv2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                56,
                                                56,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block3_conv1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block3_conv3",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block3_conv3",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                56,
                                                56,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block3_conv2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "block3_pool",
                            "trainable": false,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "block3_pool",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                56,
                                                56,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block3_conv3",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block4_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block4_conv1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                28,
                                                28,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block3_pool",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block4_conv2",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block4_conv2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                28,
                                                28,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block4_conv1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block4_conv3",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block4_conv3",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                28,
                                                28,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block4_conv2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "block4_pool",
                            "trainable": false,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "block4_pool",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                28,
                                                28,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block4_conv3",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block5_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block5_conv1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                14,
                                                14,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block4_pool",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block5_conv2",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block5_conv2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                14,
                                                14,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block5_conv1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "block5_conv3",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "block5_conv3",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                14,
                                                14,
                                                512
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "block5_conv2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
